{
  "privacy": {
    "title": "Gizlilik Politikası",
    "lastUpdated": "Son Güncelleme: 23 Ocak 2025",
    "intro": {
      "title": "Giriş",
      "content": "Happy CRM (\"biz\", \"bizim\" veya \"bize\") olarak gizliliğinizi korumaya ve kişisel bilgilerinizin güvenliğini sağlamaya kararlıyız. Bu Gizlilik Politikası, WhatsApp Business Platform entegrasyon hizmetlerimizi kullandığınızda bilgilerinizi nasıl topladığımızı, kullandığımızı, açıkladığımızı ve koruduğumuzu açıklar."
    },
    "collection": {
      "title": "Topladığımız Bilgiler",
      "personal": {
        "title": "Kişisel Bilgiler",
        "name": "Ad ve iletişim bilgileri",
        "phone": "Telefon numaraları (WhatsApp, SMS ve bildirim servisleri için)",
        "email": "E-posta adresleri",
        "business": "İşletme bilgileri ve tercihleri",
        "profile": "Kullanıcı adı ve rol dahil kullanıcı profil verileri",
        "agency": "Ajans bağlantısı ve organizasyon yapısı"
      },
      "messaging": {
        "title": "Mesajlaşma ve İletişim Verileri",
        "content": "Tüm kanallardaki mesaj içerikleri (WhatsApp, SMS, Email, Notlar)",
        "media": "URL'ler ve dosya tipleri dahil medya dosyaları",
        "metadata": "Mesaj meta verileri (zaman damgaları, teslimat durumu, okundu bilgileri)",
        "sessions": "WhatsApp 24 saatlik konuşma oturumu verileri",
        "templates": "Şablon mesaj kullanımı ve parametreleri",
        "webhooks": "WhatsApp Business API'den gelen webhook verileri"
      },
      "system": {
        "title": "Sistem ve Operasyonel Veriler",
        "leads": "Müşteri adayı ve müşteri ilişki verileri",
        "routes": "İş rotaları ve konum bilgileri",
        "notifications": "Bildirim tercihleri ve telefon numarası listeleri",
        "activity": "Kullanıcı aktivite günlükleri ve oturum bilgileri",
        "api": "API kullanımı ve entegrasyon istatistikleri"
      }
    },
    "usage": {
      "title": "Bilgilerinizi Nasıl Kullanıyoruz",
      "provide": "Çoklu kanal mesajlaşma hizmetleri sağlamak için (WhatsApp, SMS, Email)",
      "messages": "WhatsApp Cloud API üzerinden mesaj gönderme ve almayı kolaylaştırmak için",
      "templates": "Mesaj şablonlarını yönetmek ve teslim etmek için",
      "sessions": "WhatsApp 24 saatlik konuşma oturumlarını yönetmek için",
      "notifications": "Tercihlerinize göre bildirimler göndermek için",
      "support": "Müşteri desteği sağlamak ve sorulara yanıt vermek için",
      "improve": "Hizmetlerimizi geliştirmek ve yeni özellikler geliştirmek için",
      "comply": "Yasal yükümlülüklere ve Meta'nın politikalarına uymak için",
      "analytics": "Kullanım kalıplarını analiz etmek ve performansı optimize etmek için",
      "security": "Teknik sorunları ve güvenlik tehditlerini tespit etmek, önlemek ve ele almak için",
      "roles": "Sistem içindeki kullanıcı rollerini ve izinlerini yönetmek için"
    },
    "sharing": {
      "title": "Veri Paylaşımı ve Açıklama",
      "intro": "Bilgilerinizi aşağıdaki durumlarda paylaşabiliriz:",
      "meta": {
        "title": "Meta/WhatsApp ile:",
        "content": "WhatsApp Business Platform işlevselliğini etkinleştirmek için gerekli bilgileri Meta ile politikalarına uygun olarak paylaşırız."
      },
      "providers": {
        "title": "Hizmet Sağlayıcılar:",
        "content": "Platformumuzu işletmemize yardımcı olan üçüncü taraf hizmet sağlayıcılarla bilgi paylaşabiliriz (örn. bulut barındırma, analitik)."
      },
      "legal": {
        "title": "Yasal Gereklilikler:",
        "content": "Kanunla gerekli olması veya geçerli yasal taleplere yanıt olarak bilgileri açıklayabiliriz."
      },
      "consent": {
        "title": "Onayınızla:",
        "content": "Açık onayınızla veya talimatınız doğrultusunda bilgi paylaşabiliriz."
      }
    },
    "security": {
      "title": "Veri Güvenliği",
      "content": "Bilgilerinizi yetkisiz erişim, değiştirme, ifşa veya imhaya karşı korumak için uygun teknik ve organizasyonel güvenlik önlemleri uyguluyoruz. Bu önlemler şifreleme, güvenli API bağlantıları, erişim kontrolleri ve düzenli güvenlik denetimlerini içerir. Tüm WhatsApp iletişimleri Meta'nın güvenli Cloud API altyapısı üzerinden işlenir."
    },
    "notifications": {
      "title": "Bildirim Tercihleri",
      "intro": "Sizi bilgilendirmek için esnek bildirim seçenekleri sunuyoruz:",
      "types": "Bildirim türleri: son tarih hatırlatıcıları, durum değişiklikleri, sistem güncellemeleri",
      "channels": "Çoklu bildirim kanalları: WhatsApp, SMS, Email",
      "preferences": "Her bildirim türü için özelleştirilebilir tercihler",
      "numbers": "Bildirimler için birden fazla telefon numarası ekleme imkanı",
      "control": "İstediğiniz zaman bildirimleri etkinleştirme/devre dışı bırakma kontrolü"
    },
    "retention": {
      "title": "Veri Saklama",
      "content": "Bilgilerinizi yalnızca bu Gizlilik Politikası'nda belirtilen amaçları yerine getirmek için gerekli olduğu sürece saklarız, kanun tarafından daha uzun bir saklama süresi gerekmediği sürece.",
      "messages": "Mesaj verileri: WhatsApp Business Platform politikalarına göre saklanır",
      "sessions": "Oturum verileri: WhatsApp 24 saatlik konuşma pencereleri takip edilir ve arşivlenir",
      "user": "Kullanıcı verileri: Hesap aktif olduğu sürece ve kanunun gerektirdiği şekilde saklanır",
      "backups": "Yedeklemeler: Felaket kurtarma amaçları için otomatik yedeklemeler saklanır",
      "deletion": "Silme: Veri silme talepleri 30 gün içinde işlenir"
    },
    "roles": {
      "title": "Kullanıcı Rolleri ve Erişim Kontrolü",
      "intro": "Platformumuz verilerinizi korumak için rol tabanlı erişim kontrolü kullanır:",
      "superuser": "Süper kullanıcı: Tam platform erişimine sahip sistem yöneticileri",
      "admin": "Admin: Kullanıcıları ve ayarları yöneten ajans yöneticileri",
      "user": "Kullanıcı: Atanmış müşteri adaylarına ve mesajlara erişimi olan standart kullanıcılar",
      "agency": "Ajans Yapısı: Ajanslar arasında veri izolasyonu sağlayan çoklu kiracı mimarisi",
      "rls": "Satır Düzeyi Güvenlik: Kullanıcıların yalnızca yetkili verilerine erişmesini sağlayan veritabanı düzeyinde güvenlik"
    },
    "rights": {
      "title": "Haklarınız",
      "intro": "Kişisel bilgilerinizle ilgili aşağıdaki haklara sahipsiniz:",
      "access": "Kişisel verilerinize erişim ve bir kopyasını alma",
      "correct": "Yanlış veya eksik bilgileri düzeltme",
      "delete": "Kişisel verilerinizin silinmesini talep etme",
      "restrict": "Belirli işleme faaliyetlerini kısıtlama veya itiraz etme",
      "portability": "Uygun olduğunda veri taşınabilirliği",
      "withdraw": "İstediğiniz zaman onayı geri çekme",
      "notifications": "Bildirim tercihlerinizi ve telefon numaralarınızı yönetme",
      "optout": "Pazarlama iletişimlerinden çıkma",
      "reserved": "Tüm hakları saklıdır."
    },
    "whatsapp": {
      "title": "WhatsApp Business Platform Uyumluluğu",
      "content": "WhatsApp Business Platform kullanımımız Meta'nın şartlarına ve politikalarına tabidir. Aşağıdakilere uyuyoruz:",
      "terms": "WhatsApp Business Hizmet Şartları",
      "policy": "WhatsApp Business Politikası",
      "commerce": "WhatsApp Ticaret Politikası",
      "data": "Meta'nın Veri İşleme Şartları"
    },
    "international": {
      "title": "Uluslararası Veri Transferleri",
      "content": "Bilgileriniz ikamet ettiğiniz ülke dışındaki ülkelere aktarılabilir ve bu ülkelerde işlenebilir. Bu ülkeler sizin ülkenizden farklı veri koruma yasalarına sahip olabilir. Bu Gizlilik Politikası'na uygun olarak bilgilerinizi korumak için uygun güvenlik önlemlerinin alındığından emin oluyoruz."
    },
    "children": {
      "title": "Çocukların Gizliliği",
      "content": "Hizmetlerimiz 18 yaşın altındaki bireylere yönelik değildir. Bilerek çocuklardan kişisel bilgi toplamıyoruz. Bir çocuktan kişisel bilgi topladığımızın farkına varırsak, bu bilgileri silmek için adımlar atacağız."
    },
    "updates": {
      "title": "Bu Gizlilik Politikası'nın Güncellenmesi",
      "content": "Bu Gizlilik Politikası'nı zaman zaman güncelleyebiliriz. Yeni Gizlilik Politikası'nı bu sayfada yayınlayarak ve \"Son Güncelleme\" tarihini güncelleyerek sizi herhangi bir değişiklikten haberdar edeceğiz. Herhangi bir değişiklik için bu Gizlilik Politikası'nı periyodik olarak gözden geçirmeniz önerilir."
    },
    "database": {
      "title": "Veri Toplama Detayları",
      "intro": "Happy CRM sistemi aşağıdaki spesifik veri tablolarında bilgilerinizi saklar:",
      "messages": {
        "title": "Messages Tablosu",
        "content": "Tüm mesajlaşma verileri (WhatsApp, SMS, Email, Notlar), mesaj içeriği, medya URL'leri, durum bilgileri, zaman damgaları"
      },
      "whatsapp_sessions": {
        "title": "WhatsApp Sessions Tablosu",
        "content": "24 saatlik oturum yönetimi, telefon numaraları, oturum başlangıç/bitiş zamanları, template başlatma bilgileri"
      },
      "user_profiles": {
        "title": "User Profiles Tablosu",
        "content": "Kullanıcı profil bilgileri, rol atamaları (superuser, admin, user), kullanıcı adları, oluşturma tarihleri"
      },
      "agencies": {
        "title": "Agencies Tablosu",
        "content": "Ajans bilgileri, iletişim kişi adları, telefon numaraları, aktiflik durumları"
      },
      "locations": {
        "title": "Locations Tablosu",
        "content": "Konum bilgileri, adres detayları, coğrafi koordinatlar"
      },
      "routes": {
        "title": "Routes Tablosu",
        "content": "İş rotası bilgileri, güzergah detayları, konum bağlantıları"
      },
      "notification_preferences": {
        "title": "Notification Preferences Tablosu",
        "content": "Bildirim tercihleri, kanal ayarları, susturulan lead listesi, bildirim yöntemleri"
      }
    },
    "metaReview": {
      "title": "Meta App Review Uyumluluğu",
      "intro": "WhatsApp Business API kullanımımız Meta'nın app review gereksinimlerine tam uyum sağlar:",
      "purpose": {
        "title": "Kullanım Amacı",
        "content": "WhatsApp Business API sadece iş amaçlı müşteri iletişimi için kullanılmaktadır"
      },
      "templates": {
        "title": "Template Mesaj Yönetimi",
        "content": "Tüm template mesajlar Meta tarafından onaylanmış ve düzenli olarak güncellenmiştir"
      },
      "optin": {
        "title": "Kullanıcı Onayı (Opt-in)",
        "content": "Tüm kullanıcılar WhatsApp mesajlaşması için açık onay vermiştir ve opt-out seçeneklerine sahiptir"
      },
      "compliance": {
        "title": "Meta Politika Uyumu",
        "content": "WhatsApp Business Policy, Commerce Policy ve Data Processing Terms'e tam uyum sağlanmaktadır"
      }
    },
    "spamPrevention": {
      "title": "Spam Önleme Politikaları",
      "intro": "Spam önleme ve kullanıcı deneyimi koruma için aşağıdaki önlemler alınmıştır:",
      "optout": "Kullanıcıların herhangi bir zamanda mesaj almayı durdurma hakkı",
      "frequency": "Mesaj gönderim sıklığının sınırlandırılması",
      "relevant": "Sadece iş ile ilgili ve kullanıcı için değerli içerik gönderimi",
      "monitoring": "Otomatik spam tespit ve engelleme sistemleri",
      "reporting": "Kullanıcı şikayet raporlama ve hızlı çözüm mekanizmaları"
    },
    "dataRetentionSpecific": {
      "title": "Spesifik Veri Saklama Süreleri",
      "intro": "Farklı veri türleri için özel saklama süreleri:",
      "messages": "Mesaj verileri: 3 yıl veya kullanıcı silme talebi",
      "sessions": "Session verileri: 1 yıl, aktif olmayan sessionlar 6 ay",
      "userProfiles": "Kullanıcı profilleri: Hesap aktif olduğu sürece + 2 yıl",
      "notifications": "Bildirim kayıtları: 90 gün",
      "webhooks": "Webhook logları: 30 gün (debug amaçlı)",
      "errors": "Hata logları: 6 ay",
      "backups": "Yedeklemeler: 90 gün otomatik saklama"
    },
    "contact": {
      "title": "Bize Ulaşın",
      "intro": "Bu Gizlilik Politikası veya veri uygulamalarımız hakkında sorularınız varsa, lütfen bize ulaşın:",
      "email": "E-posta:",
      "address": "Adres:",
      "phone": "Telefon:"
    },
    "back": "Ana Sayfaya Dön"
  },
  "terms": {
    "title": "Hizmet Şartları ve Gizlilik Politikası",
    "description": "WhatsApp Business entegrasyonunu kullanmadan önce aşağıdaki şartları okuyup kabul etmeniz gerekmektedir.",
    "happyCrmTerms": {
      "title": "Happy CRM Hizmet Şartları",
      "serviceUsage": "Hizmet Kullanımı: Happy CRM platformunu kullanarak müşteri ilişkileri yönetimi ve WhatsApp mesajlaşma hizmetlerinden faydalanabilirsiniz.",
      "dataSecurity": "Veri Güvenliği: Tüm müşteri verileri şifrelenmiş olarak saklanır ve üçüncü taraflarla paylaşılmaz.",
      "usageResponsibilities": "Kullanım Sorumlulukları: Platform üzerinden gönderilen mesajların içeriğinden kullanıcı sorumludur.",
      "serviceInterruptions": "Hizmet Kesintileri: Bakım ve güncelleme çalışmaları sırasında geçici hizmet kesintileri yaşanabilir.",
      "checkbox": "Happy CRM Hizmet Şartlarını okudum ve kabul ediyorum"
    },
    "privacyPolicy": {
      "title": "Gizlilik Politikası",
      "dataCollection": "Veri Toplama: Hizmet kalitesini artırmak için kullanım istatistikleri ve mesaj meta verileri toplanır.",
      "dataStorage": "Veri Saklama: Kişisel veriler yalnızca hizmet süresi boyunca saklanır ve gerekli güvenlik önlemleri alınır.",
      "thirdPartySharing": "Üçüncü Taraf Paylaşımı: Verileriniz yasal zorunluluklar dışında üçüncü taraflarla paylaşılmaz.",
      "dataRights": "Veri Hakları: Verilerinize erişim, düzeltme ve silme haklarınız bulunmaktadır.",
      "checkbox": "Gizlilik Politikasını okudum ve kabul ediyorum"
    },
    "whatsappTerms": {
      "title": "WhatsApp Business API Şartları",
      "whatsappPolicies": "WhatsApp Politikaları: WhatsApp Business API kullanımı Meta'nın ticari politikalarına tabidir.",
      "messageLimits": "Mesaj Limitleri: WhatsApp tarafından belirlenen günlük mesaj limitleri geçerlidir.",
      "contentRules": "İçerik Kuralları: Spam, yanıltıcı veya zararlı içerik gönderilmesi yasaktır.",
      "accountSuspension": "Hesap Askıya Alma: Kurallara aykırı kullanım durumunda WhatsApp hesabınız askıya alınabilir.",
      "checkbox": "WhatsApp Business API şartlarını okudum ve kabul ediyorum",
      "viewPolicy": "WhatsApp Business Politikasını görüntüle"
    },
    "importantNotice": {
      "title": "⚠️ Önemli Uyarı",
      "content": "WhatsApp Business entegrasyonu aktif olduktan sonra, müşterilerinizle olan tüm iletişimler WhatsApp'ın ticari mesajlaşma politikalarına tabi olacaktır. Müşteri onayı olmadan mesaj gönderilmesi hesabınızın askıya alınmasına neden olabilir."
    },
    "buttons": {
      "decline": "Reddet",
      "accept": "Kabul Et ve Devam Et",
      "pleaseRead": "Lütfen tüm şartları okuyun"
    }
  }
}